# Specifications - Database
<p> The stakeholder wants us to create a MySQL database using the information gathered so far. We will normalize the data according to the requirements of the stakeholder. 
Data will be transformed as follows:

- Keep all data from TMDB API in 1 table together (even though it will not be perfectly normalized)
- We only need to keep imdb_id, revenue, budget, and certification columns
- Normalize genre and discard unnecessary information
    
</p>

# Imports and Loading Data

In [1]:
# Generic Imports
import pandas as pd
import json

# MySQL Imports
import pymysql
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

Connect to/create MySQL database

In [2]:
# Get SQL creds from json
creds = json.load(open('creds.json'))

pymysql.install_as_MySQLdb()

# Create connection string using credentials following this format
database = "imdb_data"
connection_str = f"mysql+pymysql://{creds['username']}:{creds['password']}@localhost/{database}"
    
# Create database if it doesn't exist
if database_exists(connection_str) == False: 
    create_database(connection_str)
    print(f'Creating database {database}')
else: 
    print(f'Database {database} exists.')

# Create Engine
engine = create_engine(connection_str)

Creating database imdb_data

Load the data and manipulate

In [3]:
# Load in the dataframe
basics_df = pd.read_csv('Data/basics.csv.gz')
basics_df.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama

# Basics/Genres SQL Table

## Normalize Data

In [4]:
## create a col with a list of genres
basics_df['genres_split'] = basics_df['genres'].str.split(',')
basics_df.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]

In [5]:
# explode the column into different rows, and get a list of unique genres we will use later
exploded_genres = basics_df.explode('genres_split')
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [6]:
# Create tconst genres_split table
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

We will create a genre mapping dictionary to replace string genres with integers for the database

In [7]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

Then we must replace the string genres in title_genres with the new integer ids

In [8]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_ID': genre_map.values()})
genre_lookup.head(3)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2

Now we wiill create the tconst and grenre_id databframe

## Creating MySQL Table for title_basics

Create the schema for the basics sql table

In [9]:
# Calculate max string lengths for object columns
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects
basics_df_schema = {
    'tconst': String(key_len + 1), 
    'primaryTitle': Text(title_len + 1),
    'startYear': Float(),
    'endYear': Float(),
    'runtimeMinutes': Integer()}

In [10]:
basics_df = basics_df.drop(columns = ['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres', 'genres_split'])

In [11]:
# Save to sql with dtype and index=False
basics_df.to_sql('title_basics', engine, dtype = basics_df_schema, if_exists = 'replace', index = False)

Set primary key

In [12]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);');

In [13]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_basics LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74

## Creating MySQL Table for genres

In [14]:
# Calculate max string lengths for object columns
gen_len = genre_lookup['Genre_Name'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns 
# Create a schema dictonary using Sqlalchemy datatype objects
gen_schema = {'genre_id': Integer(), 
    'genre_name': String(gen_len + 1)}

In [15]:
genre_lookup.to_sql('genres', engine, dtype = gen_schema, if_exists = 'replace', index = False)

Set primary key to genre_id

In [16]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);');

In [17]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM genres LIMIT 5
"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Creating MySQL Table for title_genres

In [18]:
# Calculate max string lengths for object columns
title_gen_len = title_genres['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns 
# Create a schema dictonary using Sqlalchemy datatype objects
title_gen_schema = {'tconst': String(title_gen_len + 1), 
    'genre_id': Integer()}

In [19]:
title_genres.to_sql('title_genres', engine, dtype = title_gen_schema, if_exists = 'replace', index = False)

In [20]:
q = """
SELECT * 
FROM title_genres LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

Join tables don't need a primary key (you'd receive an error anyways with multiple entries)

# Ratings SQL Table

Import ratings data

In [21]:
ratings_df = pd.read_csv('Data/ratings.csv.gz')
ratings_df.head(3)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1876
1  tt0000002            5.9       248
2  tt0000003            6.5      1649

## Creating MySQL Table for title_ratings

In [22]:
# Calculate max string lengths for object and create schema
rating_len = ratings_df['tconst'].fillna('').map(len).max()
rat_schema = {'tconst': String(rating_len + 1), 
    'averageRating': Float(),
    'numVotes': Integer()}

In [23]:
ratings_df.to_sql('title_ratings', engine, dtype = rat_schema, if_exists = 'replace', index = False)

In [24]:
q = """
SELECT * 
FROM title_ratings LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1876
1  tt0000002            5.9       248
2  tt0000003            6.5      1649
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

# TMDB Data SQL Table

Import tmdb data with only required tables

In [25]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_df.head(4)

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694  12854953.0    150000.0            PG

## Creating MySQL Table for tmdb_data

In [26]:
# Calculate max string lengths for objects and create schema
tmdb_len = tmdb_df['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_df['certification'].fillna('').map(len).max()
tmdb_schema = {'imdb_id': String(tmdb_len + 1), 
    'revenue': Float(),
    'budget': Float(),
    'certification': String(cert_len + 1)}

In [27]:
tmdb_df.to_sql('tmdb_data', engine, dtype = tmdb_schema, if_exists = 'replace', index = False)

In [28]:
q = """
SELECT * 
FROM tmdb_data LIMIT 5
"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0          None
1  tt0113092         0.0         0.0          None
2  tt0116391         0.0         0.0          None
3  tt0118694  12855000.0    150000.0            PG
4  tt0118852         0.0         0.0             R

# Showing Final Tables

In [29]:
pd.read_sql("SHOW TABLES;", engine)

  Tables_in_imdb_data
0              genres
1        title_basics
2        title_genres
3       title_ratings
4           tmdb_data